{
    "version": "https://jsonfeed.org/version/1",
    "title": "码农日常这一块 • All posts by \"演讲\" tag",
    "description": "",
    "home_page_url": "http://example.com",
    "items": [
        {
            "id": "http://example.com/2025/03/23/2025-03-23-ThreeGoGamesofLife/",
            "url": "http://example.com/2025/03/23/2025-03-23-ThreeGoGamesofLife/",
            "title": "Three Go Games of Life",
            "date_published": "2025-03-22T16:00:00.000Z",
            "content_html": "<p>Hello everyone!</p>\n<p>Today, I want to introduce myself through the ancient game of Go. Just as a Go board has 361 possibilities, my life has been shaped by calculated moves, unexpected setbacks, and unbrokenable friendlyship—even when the game doesn’t go as planned.</p>\n<p>The opening phase of Go is all about balancing ambition and caution, however, I learned this the hard way. At 12, I lost my first official Go match because of reckless opening moves. That time my mentor said I was building castles on the sand,asking me to focus on fundamentals and stability. So I started studying classic strategies, practicing daily, and avoiding shortcuts. One year later, I finally achieved second dan. Go taught me that a strong foundation matters more than early victories.</p>\n<p>The middle game is all about adaptability. Once, I faced a seasoned player who trapped me. Panicking, I made impulsive moves and lost. That time I froze under pressure and misread the strategies. But then I reviewed every mistake, journaled my errors, trained with stronger opponents, and eventually overcame my fear of failure. Go’s middle game taught me that defeat isn’t failure unless you stop learning.</p>\n<p>Go’s endgame taught me that even solo games need connection. When I was trailing by 3 points, my hands trembling, my childhood friend, who had trained with me for years, whispered, “Breathe. You’ve faced harder fights.” Her calmness calm me down. Inspired, I won by half a point. Later, when she struggled with depression, I returned the support, reminding her of our Go mantra: “Stones may fall, but the board remains.”</p>\n<p>Life of me, like Go, isn’t about winning every match. My three battles taught me to value growth over titles. Today, I’m still a Go amateur—but every game deepens my respect for strategy, adaptability, and friendlyship. The board remains my teacher, reminding me: “<strong>A lost game still holds winning lessons.</strong>”</p>\n<p>Thank you.</p>\n",
            "tags": [
                "创作",
                "演讲"
            ]
        }
    ]
}